Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཕྱོགས་བཅུ་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་མང་པོ་བཀྱེ་བ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་ཅིང་སྤྱི་བོར་འཆར་བ་ལ་ལྟོས་ཤིག་ཅེས་དེ་དག་ལ་སོགས་པ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས།
en: All the tathāgatas in the ten directions emanate multitudes of disks composed of nets of light rays that resound with all the Dharma of the buddhas and descend onto the crown of his head.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལམ་དུ་ཞུགས་པའི་ཡོན་ཏན་གྱི་རྒྱན་ཚད་མེད་པ་དག །དགེ་སློང་དེ་དག་ལ་ཡོངས་སུ་བསྟན་ཏོ། །བརྗོད་དོ་བཤད་དོ། །སྨོས་སོ། །བཀྲོལ་ལོ། །རབ་ཏུ་བརྗོད་དོ། །རྣམ་པར་ཕྱེའོ། །གསལ་བར་བྱས་སོ། །དེ་ལྟར་གནས་བརྟན་ཤཱ་རིའི་བུས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཡོན་ཏན་ཅི་ཙམ་ཅི་ཙམ་དུ་བརྗོད་པ་དེ་ཙམ་དེ་ཙམ་དུ་དགེ་སློང་དེ་དག་གི་སེམས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ། །མོས་པ་སྐྱེས་པར་གྱུར་ཏོ། །དེ་དག་གི་སེམས་ཀྱི་རྒྱུད་ལས་སུ་རུང་བར་གྱུར་ཏོ། །དབང་པོ་རབ་ཏུ་དང་བར་གྱུར་ཏོ། །ཡིད་བདེ་བ་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ། །ཡིད་མྱི་བདེ་བ་རབ་ཏུ་བྱང་བར་གྱུར་ཏོ། །སེམས་ཀྱི་སྐྱོན་དང་བྲལ་བར་གྱུར་ཏོ། །སྒྲིབ་པ་ཐམས་ཅད་ཕྱིར་ལྡོག་པར་གྱུར་ཏོ། །སངས་རྒྱས་བལྟ་བ་ལ་མངོན་པར་མོས་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཆོས་ལ་སེམས་རབ་ཏུ་གཞོལ་བར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཡོངས་སུ་དག་པར་གྱུར་ཏོ། །
en: Beginning with the above, Brother Śāriputra described, explained, announced, narrated, related, elucidated, and brought illumination to the bhikṣus concerning Mañjuśrī’s measureless displays of the qualities of following the path.

source: བྱང་ཆུབ་སེམས་དཔའི་དད་པའི་ཤུགས་སྐྱེས་པར་གྱུར་ཏོ། །སྙིང་རྗེ་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ། །ཕ་རོལ་ཏུ་ཕྱིན་པའི་དཀྱིལ་འཁོར་གནོན་པར་གྱུར་ཏོ། །སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་སྐྱེས་པར་གྱུར་ཏོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་རྒྱ་མཚོ་ཡོངས་སུ་སྣང་བར་གྱུར་ཏོ། །
en: The more that Sthavira Śāriputra described Mañjuśrī Kumāra­bhūta’s qualities, the more the minds of the bhikṣus became purified and became clearer, the strength of their joy increased, delight arose, the continuum of their minds became adept, their faculties became clearer, their happiness increased, they cast off unhappiness, they became free of the mind’s faults, they repelled all obscurations, they became intent on seeing the Buddha, their minds turned to the Buddha’s Dharma, their bodhisattva faculties were purified, the power of their bodhisattva faith developed, great compassion arose, they gained the prowess of the domain of the perfections, they fully developed great compassion, and they perceived the ocean of buddhas in the ten directions.

source: དེ་ལྟར་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མོས་པའི་ཤུགས་ཐོབ་པར་གྱུར་ནས་འདི་སྐད་འཛེར་ཏོ། །མཁན་པོ་བདག་ཅག་ཀྱང་སྐྱེས་བུ་དམ་པ་དེའི་དྲུང་དུ་ཕྱིན་པར་མཛད་དུ་གསོལ་ཞེས་ནས།
en: Having attained the power of aspiration to omniscience, they spoke these words: “Upādhyāya, we pray that we too may be able to go into the presence of that supreme being.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དགེ་སློང་དེ་དག་དང་འགྲོགས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་སོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་དགེ་སློང་འདི་དག་ནི་ཁྱོད་ལ་བལྟ་བར་འདོད་པ་དག་གོ །
en: Then Brother Śāriputra, together with the bhikṣus, went to where Mañjuśrī Kumāra­bhūta was and said these words: “Mañjuśrī, these bhikṣus wish to see you.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དགེ་སློང་དེ་དག་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་སའི་ཕྱོགས་དེ་ཙམ་དང་བཅས་པར་གླང་པོའི་ལྟ་སྟངས་ཀྱི་གཟི་དང་ལྡན་པར་ཁྱབ་པར་བལྟས་པ་དང་། དེའི་རྗེས་ལ་དགེ་སློང་དེ་དག་གིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Then Mañjuśrī Kumāra­bhūta, together with the entire circle of his followers, turned and looked upon the bhikṣus with the majestic gaze of an elephant.

source: ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་མཐོང་བ་དང་། ཁྱོད་ལ་ཕྱག་འཚལ་བའི་དགེ་བའི་རྩ་བ་འདི་དང་བདག་ཅག་གི་དགེ་བའི་རྩ་བ་གཞན་ཁྱོད་ཀྱིས་མཁྱེན་པ་དང་། མཁན་པོས་ཐུགས་སུ་ཆུད་པ་དང་། གང་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་མངོན་དུ་གཟིགས་པའི་དགེ་བའི་རྩ་བ་དེས།
en: The bhikṣus bowed their heads to the feet of Mañjuśrī Kumāra­bhūta, and then with their palms together in reverence they said, “Holy being, through the roots of merit from seeing you and paying homage to you, and also our other roots of merit that you know we have, that our upādhyāya knows we have, and that the Bhagavat Tathāgata Śākyamuni sees we have, may we become like you.

source: ཁྱོད་ཅི་འདྲ་བ་དེ་འདྲ་བར་གྱུར་ཏེ། རྣམ་པ་འདི་འདྲ་བའི་ལུས་ཐོབ་པར་ཤོག་ཤིག །རྣམ་པ་འདི་འདྲ་བའི་དབྱངས་དང་།
en: May we obtain bodies that are the same as yours, voices the same as yours, and features the same as yours, and may we attain miraculous powers the same as yours.”

source: རྣམ་པ་འདི་འདྲ་བའི་མཚན་དང་། འདི་ལྟ་བུའི་རྣམ་པར་འཕྲུལ་པ་དག་ཀྱང་ཁྱོད་ཇི་ལྟ་བ་བཞིན་དུ་ཐོབ་པར་ཤོག་ཤིག་ཅེས་དགེ་སློང་དེ་དག་གིས་དེ་སྐད་དུ་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དགེ་སློང་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགེ་སློང་དག་ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་བཅུ་དང་ལྡན་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྟ་སྨོས་ཀྱང་ཅི་སྨོས་ཀྱི། དེ་བཞིན་གཤེགས་པའི་ས་ཡང་གནོན་པར་འགྱུར་རོ། །
en: When the bhikṣus had said this, Mañjuśrī Kumāra­bhūta said to the bhikṣus, “Bhikṣus, the noble man or noble woman with the ten unflagging motivations who enters the Mahāyāna will ascend to the level of a tathāgata, and therefore, it goes without saying, to the level of a bodhisattva.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་བལྟ་བ་དང་། བསྙེན་བཀུར་བ་དང་། མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསྩགས་པ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། ཆོས་ཐམས་ཅད་བཙལ་བ་ལ་ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་སྦྱོར་བ་ལ་ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་།
en: What are those ten?

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པ་ལ་ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། དུས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་དུ་འཇུག་པ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་རྒྱས་པར་དགང་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ། ཡོངས་སུ་མྱི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། ཞིང་དང་བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྦྱར་བས་སེམས་ཅན་གཅིག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཚུལ་དུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་གཅིག་ཡོངས་སུ་བསྒྲུབ་པ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པའོ། །
en: They are (1) the unflagging motivation to see, pay homage to, offer to, and serve all the tathāgatas; (2) the unflagging motivation to never abandon accumulating all roots of merit; (3) the unflagging motivation to seek all Dharmas; (4) the unflagging motivation to practice all the bodhisattva perfections; (5) the unflagging motivation to accomplish all the bodhisattva samādhis; (6) the unflagging motivation to enter all successive times; (7) the unflagging motivation to purify the extensive oceans of buddha realms in the ten directions; (8) the unflagging motivation to ripen and guide all realms of beings; (9) the unflagging motivation to accomplish the conduct of a bodhisattva in all realms and kalpas; and (10) the unflagging motivation to accomplish one power of the tathāgatas by ripening all beings in the way that one would ripen one being through the practice of perfections as numerous as the atoms in all buddha realms.

source: དགེ་སློང་དག་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་བསྐྱེད་པ་བཅུ་པོ་འདི་དག་དང་ལྡན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དད་པ་དང་ལྡན་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་རོ། །འཁོར་བའི་རྒྱུད་ཐམས་ཅད་ལས་ཕྱིར་ལྡོག་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་རྒྱུད་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པར་འགྱུར་རོ། །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ཐམས་ཅད་ལས་ཡོངས་སུ་འདའ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་དང་རྒྱུད་དུ་འབྱུང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ལ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ནན་ཏན་ལ་རྣམ་པར་དག་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་ལ་ཡང་དག་པར་འབྱུང་བར་འགྱུར་རོ། །བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་རབ་ཏུ་འདུལ་བར་འགྱུར་རོ། །
en: “Bhikṣus, the noble man or noble woman with faith who has these ten unflagging motivations will accomplish all roots of merit, will turn away from all existences in saṃsāra, will transcend all the worldly existences, will transcend all the levels of śrāvakas and pratyeka­buddhas, will become a member of the family of all the tathāgatas, will accomplish the aspirations of all bodhisattvas, will purify the practice of the qualities of all the tathāgatas, will purify all bodhisattva conduct, will have the strength of all tathāgatas, will subdue all māras and adversaries, will ascend to the level of bodhisattvas, and will approach the level of the tathāgatas.”

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པའི་ས་དང་ཤིན་ཏུ་ཉེ་བར་འགྱུར་རོ། །དེ་ནས་དགེ་སློང་དེ་དག་གིས་ཆོས་ཀྱི་ཚུལ་འདི་ཐོས་ནས། སངས་རྒྱས་ཐམས་ཅད་རྣམ་པར་མཐོང་བ་ལ་ཆགས་པ་མེད་པའི་མིག་གི་ཡུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ། །
en: When the bhikṣus heard this way of the Dharma, they attained the samādhi the unimpeded vision that sees all the buddhas.

source: དེའི་མཐུས་ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་མཐོང་བར་གྱུར་ཏོ། །
en: Through its power they saw all the tathāgatas and the circles of their assemblies that were present in infinite, endless world realms in the ten directions.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་འགྲོ་བའི་རྒྱུད་དུ་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་མ་ལུས་པ་མཐོང་བར་གྱུར་ཏོ། །
en: They also saw every being that had been reborn into an existence in those world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་རྣམས་ཀྱང་མ་ལུས་པར་མཐོང་བར་གྱུར་ཏོ། །
en: They saw every being in those world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཀྱང་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་སུ་མཐོང་བར་གྱུར་ཏོ། །
en: They saw the various divisions of those world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་ཤེས་པར་གྱུར་ཏོ། །
en: They knew the number of atoms in those worlds.

source: སེམས་ཅན་དེ་དག་གི་རིན་པོ་ཆེའི་གནས་དང་། ལོངས་སྤྱོད་དེ་དག་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །
en: They saw the residences and adornments made of jewels that those beings enjoyed.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཡང་ཐོས་པར་གྱུར་ཏོ། །
en: They heard the ocean of the aspects of speech of those tathāgatas.

source: ཆོས་བསྟན་པ་དེ་དག་ཀྱང་ཚིག་དང་ཡི་གེ་དང་ངེས་པའི་ཚིག་དང་སྐད་དང་མིང་དང་བརྡས་ཡོངས་སུ་ཤེས་པར་གྱུར་ཏོ། །
en: They knew those Dharma teachings through their words, letters, definitions, languages, names, and symbols.

source: སེམས་ཅན་དེ་དག་གི་སེམས་དང་དབང་པོ་དང་བསམ་པ་ལ་ཡང་རྣམ་པར་ལྟ་བར་གྱུར་ཏོ། །
en: They viewed the minds, faculties, and aspirations of those beings.

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་ཚེ་རབས་བཅུ་ཡང་རྗེས་སུ་དྲན་པར་གྱུར་ཏོ། །
en: They knew ten lifetimes back into the past and ten lifetimes into the future.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཆོས་ཀྱི་འཁོར་ལོ་བཅུའི་ངེས་པའི་ཚིག་མངོན་པར་བསྒྲུབ་པ་ལ་ཡང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ། །
en: They comprehended the explanations of ten turnings of Dharma wheels by those tathāgatas.

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་མངོན་པར་བསྒྲུབ་པ་བཅུ་ལ་ཡང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ། །
en: They comprehended ten attainments of manifestations of miraculous powers.

source: བསྟན་པའི་ཚུལ་མངོན་པར་བསྒྲུབ་པ་བཅུ་ལ་ཡང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ། །
en: They comprehended the accomplishment of ten ways given in the teachings.

source: རྗེས་སུ་བསྟན་པའི་ཚིག་མངོན་པར་བསྒྲུབ་པ་བཅུ་ལ་ཡང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ། །
en: They comprehended ten explanations of the words of the teachings.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་མངོན་པར་བསྒྲུབ་པ་བཅུ་ལ་ཡང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏེ། ཏིང་ངེ་འཛིན་དེ་ཐོབ་མ་ཐག་ཏུ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །
en: They comprehended ten accomplishments of the analytic knowledge of those tathāgatas.

source: ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་ནོན་པར་གྱུར་ཏོ། །ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡན་ལག་སྟོང་ཕྲག་བཅུ་ཡང་རྣམ་པར་དག་པར་གྱུར་ཏེ། སྣང་བ་ཆེན་པོ་རབ་ཏུ་ཐོབ་ཅིང་ཤེས་རབ་ཆེན་པོའི་དཀྱིལ་འཁོར་གྱི་སྣང་བར་གྱུར་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བཅུ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: As soon as they attained that samādhi, they perfected ten thousand aspects of the aspiration to enlightenment, they attained ten thousand samādhis, they purified ten thousand aspects of the perfections, they attained a great radiance, they illuminated the domain of great wisdom, and they attained ten bodhisattva clairvoyances.

source: དེ་ལྟར་མངོན་པར་ཤེས་པའི་མྱུ་གུ་གཞོན་ཞིང་ཤིན་ཏུ་ཕྲ་བ་ཐོབ་སྟེ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་བརྟན་པ་ལ་གནས་པ་དེ་དག་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་ཡང་དག་པར་བསྐུལ་ནས་རབ་ཏུ་བཀོད་དོ། །
en: They who had thus attained the small young seedlings of clairvoyance and had gained the resolute aspiration to enlightenment were then inspired to and established in completely good bodhisattva conduct by Mañjuśrī Kumāra­bhūta.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་རབ་ཏུ་གནས་པ་དེ་དག་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ཞུགས་ཤིང་མངོན་པར་སྒྲུབ་པར་གྱུར་ཏོ། །
en: They who were thus established in completely good bodhisattva conduct entered an ocean of great aspirations and fulfilled them.

source: དེ་ལྟར་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོས་མངོན་པར་བསྒྲུབ་པའི་སེམས་རྣམ་པར་དག་པས་ལུས་ཡོངས་སུ་དག་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: Through fulfilling an ocean of great aspirations with a pure motivation they attained purity of the body.

source: ལུས་རྣམ་པར་དག་པས་ལུས་ཡང་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: Through purity of the body they attained lightness of body.

source: དེ་ལྟར་ལུས་རྣམ་པར་དག་པ་དང་ལུས་ཡང་བས་མངོན་པར་ཤེས་པའི་སྒོ་དེ་དག་ཤིན་ཏུ་ཡངས་པར་བྱེད་པས།
en: Through that purity of body and lightness of body they vastly increased their entrances to clairvoyances.

source: མི་ཉམས་ཤིང་རྗེས་སུ་འབྲང་བའི་མངོན་པར་ཤེས་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: They attained everlasting clairvoyances.

source: མངོན་པར་ཤེས་པ་དེ་ཐོབ་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པའི་དྲུང་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་ཕྱོགས་བཅུར་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུའི་འཕྲིན་ལས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲུབ་པར་གྱུར་ཏོ། །
en: Through that attainment of clairvoyance, while constantly remaining at the feet of Mañjuśrī Kumāra­bhūta and in order to accomplish all the Dharmas of the buddhas, they created clouds of the activities of the bodies of all the tathāgatas in the ten directions.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། དགེ་སློང་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བཀོད་ནས་མཐར་གྱིས་ཡུལ་རྒྱུ་ཞིང་ལྷོ་ཕྱོགས་ལོགས་སུ་སྐྱིད་པའི་འབྱུང་གནས་ཞེས་བྱ་བའི་གྲོང་རྡལ་ཆེན་པོ་གང་ན་བ་དེར་ལོགས་སུ་སོང་སྟེ།
en: Then Mañjuśrī Kumāra­bhūta, having established those bhikṣus in the aspiration to the highest, complete enlightenment, traveled to the southern region and came to the great city called Dhanyākara.

source: ཕྱིན་ནས་གྲོང་རྡལ་ཆེན་པོ་སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་ཤར།
en: Having reached there, he and his entourage went the east of Dhanyākara, where there was a great forest called Vicitra­sāla­dhvaja­vyūha.

source: ཕྱོགས་ལོགས་ན་ནགས་ཚལ་ཆེན་པོ་སཱ་ལ་སྣ་ཚོགས་ཀྱི་རྒྱལ་མཚན་གྱི་རྒྱན་ཅེས་བྱ་བ་སྔོན་གྱི་སངས་རྒྱས་བཞུགས་བཞུགས་པའི་མཆོད་རྟེན་སེམས་ཅན་སྨིན་པར་མཛད་པའི་དོན་དུ།
en: It was a sacred place where buddhas of the past had dwelled.

source: དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པ།
en: It had been consecrated by the tathāgatas for the ripening of beings.

source: ཞིང་མཐའ་ཡས་པར་མིང་གི་སྒྲ་རྗེས་སུ་གྲགས་པ།
en: Its name was renowned throughout endless realms.

source: སྔོན་ཅད་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། ཡོངས་སུ་གཏང་བར་དཀའ་བ་དུ་མ་ཡོངས་སུ་བཏང་བ་སྟེ།
en: It was a place where the Bhagavat, when he was practicing bodhisattva conduct in the past, performed many difficult actions of generosity.

source: སའི་ཕྱོགས་དེ་ན་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མཆོད་པ་ལ་བརྩོན་པའི་གནས་ཡོད་པ་དེར་འཁོར་དང་བཅས་ཏེ་ཕྱིན་ནས་དེར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས།
en: It was a place where devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans constantly engaged in making offerings.

source: མདོ་སྡེ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་འབྱུང་བ་བསྟན་ཏོ། །
en: There Mañjuśrī Kumāra­bhūta taught the sūtra called The Radiance of the Way of the Essence of Phenomena, from which arose a septillion sūtras.

source: དེ་བསྟན་པའི་ཚེ་རྒྱ་མཚོ་ཆེན་པོ་ནས་ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཉེ་བར་ལྷགས་ཏེ།
en: During that teaching, many hundred thousand quintillions of nāgas came from the great ocean.

source: དེ་དག་གིས་ཆོས་ཀྱི་ཚུལ་དེ་ཐོས་ནས། ཀླུའི་རྒྱུད་ལ་རྣམ་པར་སྨོད་ཅིང་། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ལ་མོས་པར་གྱུར་ནས་ཀླུའི་རྒྱུད་རྣམ་པར་བཟློག་སྟེ།
en: When they had heard that way of the Dharma, they became disgusted with their existences as nāgas and aspired to have the qualities of a tathāgata.

source: ལྷ་དང་མིར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པར་གྱུར་ནས།
en: They abandoned their nāga existences and gained rebirth as devas or humans.

source: དེར་ཀླུ་སྟོང་ཕྲག་བཅུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Ten thousand nāgas attained irreversibility from the highest, complete enlightenment.

source: ཆོས་དེ་བསྟན་པའི་ཚེ་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ། ཐེག་པ་གསུམ་གྱིས་དུས་གཞན་དང་གཞན་དུ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ། །
en: During the time he taught that Dharma, endlessly numerous realms of beings were guided through the three yānas.

source: དེ་ནས་སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་མི་རྣམས་ཀྱིས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་གྲོང་རྡལ་དུ་ཕྱིན་ཏེ། སཱ་ལ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱི་མཆོད་རྟེན་གྱི་གཞི་འདི་ཉིད་ན་རྣམ་པར་སྤྱོད་དོ་ཞེས་ཐོས་ནས། དགེ་བསྙེན་ཚོང་དཔོན་ཤེས་རབ་ཆེན་པོ་ལ་སོགས་པ། དགེ་བསྙེན་པ་དང་།
en: The people in Dhanyākara heard that Mañjuśrī Kumāra­bhūta had come to Dhanyākara and was dwelling in the sacred Vicitra­sāla­dhvaja­vyūha.

source: དགེ་བསྙེན་མ་དང་། ཁྱེའུ་དང་བུ་མོ་མང་པོ་དག་སོ་སོ་ནས་འཁོར་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་བཅས་ཏེ། སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་གྲོང་རྡལ་ནས་བྱུང་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ངོ་། །དེ་ལ་དགེ་བསྙེན་ཤེས་རབ་ཆེན་པོ་ནི་དགེ་བསྙེན་བཟང་པོས་བྱིན་དང་། ལྷས་བྱིན་དང་། བསོད་ནམས་འོད་དང་། གྲགས་པའི་ལྷ་དང་གྲགས་པས་བྱིན་དང་། ཟླ་བའི་དཔལ་དང་། ཟླ་བ་དགའ་བོ་དང་། བློ་གྲོས་བཟང་པོ་དང་། བློ་གྲོས་ཆེན་པོ་དང་།
en: The leading upāsaka Mahāprajña and upāsakas, upāsikās, sons, and daughters, each accompanied by an entourage that numbered five hundred, came out from Dhanyākara city and went to where Mañjuśrī Kumāra­bhūta was.

source: སྒྲ་གཅན་བཟང་པོ་དང་། དགེ་བསྙེན་བཟང་པོའི་དཔལ་དང་། དེ་དག་ལ་སོགས་པ་དགེ་བསྙེན་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ལ་དགེ་བསྙེན་མ་ཤེས་རབ་ཆེན་མོ་ནི། དགེ་བསྙེན་མ་འོད་བཟང་མོ་དང་། ལུས་བཟང་མོ་དང་། དགེ་བ་ཡོད་པ་དང་། དགེ་བའི་དཔལ་དང་། ཟླ་བའི་འོད་དང་།
en: The upāsaka Mahāprajña, with other upāsakas such as Sudatta, Vasudatta, Puṇya­prabha, Yaśodeva, Somaśriti, Somanandi, Sumati, Mahāmati, Rāhulabhadra, Bhadra­śrī, and so on, each with an entourage of five hundred upāsakas, came to where Mañjuśrī Kumāra­bhūta was, bowed their heads to his feet, circumambulated Mañjuśrī Kumāra­bhūta three times, and sat to one side.

source: དཔལ་གྱི་འོད་དང་། དཔལ་བཟང་མོ་དང་། དགེ་བསྙེན་མ་མིག་བཟང་མོ་དང་། དེ་དག་ལ་སོགས་པ་དགེ་བསྙེན་མ་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ལ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ནི། ཚོང་དཔོན་གྱི་བུ་བརྟུལ་ཞུགས་བཟང་པོ་དང་། ཚུལ་ཁྲིམས་བཟང་པོ་དང་། ངང་ཚུལ་བཟང་པོ་དང་། རྣམ་པར་གནོན་པ་བཟང་པོ་དང་། བསམ་པ་བཟང་པོ་དང་། བློ་གྲོས་བཟང་པོ་དང་། བློ་བཟང་པོ་དང་། མིག་བཟང་པོ་དང་།
en: The upāsikā named Mahāprajñā, with other upāsikās such as Suprabhā, Sugātrā, Subhadrā, Bhadra­śrī, Candra­prabhāsā, Ketuprabhā, Śrībhadrā, and Sulocanā and so on, each with an entourage of five hundred upāsikās, came to where Mañjuśrī Kumāra­bhūta was, bowed their heads to his feet, circumambulated Mañjuśrī Kumāra­bhūta three times, and sat to one side.

source: ལག་པ་བཟང་པོ་དང་། ཚོང་དཔོན་གྱི་བུ་འོད་བཟང་པོ་དང་། དེ་དག་ལ་སོགས་པ་ཚོང་དཔོན་གྱི་བུ་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ལ་ཁྱིམ་བདག་ཤེས་རབ་ཆེན་པོའི་བུ་མོ་དགེ་བ་བཟང་མོ་ནི་བུ་མོ་བཟང་མོ་དང་། ཡིད་དུ་འོང་བའི་བཞིན་དང་། བརྟན་པའི་བློ་གྲོས་དང་།
en: The head merchant’s son Sudhana, with other sons of head merchants such as Suvrata, Suśīla, Svācāra, Suvikrāmin, Sucinti, Sumati, Subuddhi, Sunetra, Subāhu, Suprabha, and so on, each with an entourage of five hundred sons of head merchants, came to where Mañjuśrī Kumāra­bhūta was, bowed their heads to his feet, circumambulated Mañjuśrī Kumāra­bhūta three times, and sat to one side.

source: དཔལ་བཟང་མོ་དང་། ཚངས་པས་བྱིན་དང་། དཔལ་གྱི་འོད་དང་། བུ་མོ་འོད་བཟང་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་གྲོང་རྡལ་ནས་སྐྱེས་པ་དང་།
en: Subhadrā, the daughter of the layman Mahāprajña, with other daughters such as Bhadrā, Abhirāmavartā, Dṛḍhamatī, Śrībhadrā, Brahmadattā, Śrīprabhā, Suprabhā, and so on, each with an entourage of five hundred daughters, came to where Mañjuśrī Kumāra­bhūta was, bowed their heads to his feet, circumambulated Mañjuśrī Kumāra­bhūta three times, and sat to one side.

source: བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་དེ་དག་འདུས་ཏེ། འཁོད་པར་ཤེས་ནས་བསམ་པ་ཇི་ལྟ་བཞིན་དུ་བསྟན་པའི་བྱིན་གྱི་ཟིལ་གྱིས་མནན་ཏེ་བྱམས་པ་ཆེན་པོའི་བྱིན་གྱིས་ཚིམ་པར་བྱས་ནས། སྙིང་རྗེ་ཆེན་པོའི་བྱིན་གྱིས་ཆོས་བསྟན་པ་མངོན་པར་བསྒྲུབས་ཏེ། ཡེ་ཤེས་ཀྱི་བྱིན་གྱིས་སེམས་དང་བསམ་པ་རྣམ་པར་ཕྱེ་ནས།
en: Then Mañjuśrī Kumāra­bhūta, knowing that the men, women, boys, and girls from Dhanyākara had gathered and assembled, overwhelmed them with the magnificence of his teaching in accordance with their wishes, comforted them with the magnificence of his great love, accomplished the teaching of the Dharma through the magnificence of his great compassion, and investigated their minds and aspirations through the magnificence of his wisdom.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཆེན་པོས་ཆོས་བསྟན་པར་དགའ་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་བལྟས་སོ། །
en: Delighting in teaching the Dharma with his great discernment, he observed Sudhana, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཤེས་བྱ་བ་ཅིའི་ཕྱིར་ནོར་བཟངས་ཤེས་བྱ་ཞེ་ན།
en: He said, “Why is Sudhana, the head merchant’s son, called Sudhana?

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཞེས་བྱ་བ་དེ་ཐོག་མ་མའི་མངལ་དུ་ཞུགས་མ་ཐག་ཏུ་ཁྱིམ་དེའི་འཁོར་ཀུན་ནས་རྣམ་པར་ཕྱེ་བའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྡོང་པོ་འཐོན་པར་གྱུར་ཏོ། །
en: The instant that Sudhana, the head merchant’s son, entered his mother’s womb, all around his home seven precious sprouts emerged.

source: རིན་པོ་ཆེའི་སྡོང་པོ་དེ་དག་གི་འོག་ན་རིན་པོ་ཆེའི་གཏེར་བདུན་ཡོད་དེ།
en: Beneath those precious sprouts there were seven treasures of precious substances.

source: གསེར་དང་དངུལ་དང་བཻ་ཌཱུརྱ་དང་། ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་། ཨ་སྨ་གར་བྷ་དང་། མུ་ས་ར་གལྤ་དང་། རིན་པོ་ཆེ་དེ་བདུན་གྱི་རིན་པོ་ཆེའི་སྡོང་པོ་དེ་དག་ཀྱང་གཏེར་དེ་དག་ནས་སྐྱེས་ཏེ།
en: Those precious sprouts made of those seven precious substances rose up through the ground from those treasures, which were gold, silver, beryl, crystal, red pearls, emeralds, and white coral.

source: སའི་གཞི་བརྟོལ་ནས་མངོན་པར་འཐོན་པར་གྱུར་ཏོ། །དེ་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་ཏེ། ཟླ་བ་བཅུ་ལོན་ནས་བཙས་པ་དང་།
en: “After ten months, when his limbs and body parts were completely formed, he was born.
